[
    {
        "title": "Generation of structure-guided pMHC-I libraries using Diffusion Models",
        "summary": "Personalized vaccines and T-cell immunotherapies depend critically on\nidentifying peptide-MHC class I (pMHC-I) interactions capable of eliciting\npotent immune responses. However, current benchmarks and models inherit biases\npresent in mass-spectrometry and binding-assay datasets, limiting discovery of\nnovel peptide ligands. To address this issue, we introduce a structure-guided\nbenchmark of pMHC-I peptides designed using diffusion models conditioned on\ncrystal structure interaction distances. Spanning twenty high-priority HLA\nalleles, this benchmark is independent of previously characterized peptides yet\nreproduces canonical anchor residue preferences, indicating structural\ngeneralization without experimental dataset bias. Using this resource, we\ndemonstrate that state-of-the-art sequence-based predictors perform poorly at\nrecognizing the binding potential of these structurally stable designs,\nindicating allele-specific limitations invisible in conventional evaluations.\nOur geometry-aware design pipeline yields peptides with high predicted\nstructural integrity and higher residue diversity than existing datasets,\nrepresenting a key resource for unbiased model training and evaluation. Our\ncode, and data are available at: https://github.com/sermare/struct-mhc-dev.",
        "url": "http://arxiv.org/abs/2507.08902v2",
        "published_date": "2025-07-11T08:29:18+00:00",
        "updated_date": "2025-08-21T06:39:45+00:00",
        "categories": [
            "q-bio.QM",
            "cs.AI"
        ],
        "authors": [
            "Sergio Mares",
            "Ariel Espinoza Weinberger",
            "Nilah M. Ioannidis"
        ],
        "pdf_url": "http://arxiv.org/pdf/2507.08902v2",
        "tldr": "This paper introduces a diffusion model-based approach to generate a novel, structurally-guided pMHC-I peptide library, addressing biases in existing datasets and revealing limitations in current sequence-based prediction models.",
        "explanation": "The paper addresses the problem of biases in existing pMHC-I datasets which limits the discovery of novel peptide ligands for personalized vaccines and T-cell immunotherapies. The authors propose a structure-guided benchmark of pMHC-I peptides designed using diffusion models, conditioning on crystal structure interaction distances. The generated library spans multiple HLA alleles, is independent of previously characterized peptides, and reproduces canonical anchor residue preferences, indicating structural generalization without experimental dataset bias. Performance of state-of-the-art sequence-based predictors is poor on this dataset, highlighting limitations not visible in conventional evaluations.  The code and data are publicly available.",
        "interests_alignment": "This work strongly aligns with my research interests. It involves machine learning (diffusion models) for biomolecules (peptides, MHC-I complexes), addresses dataset biases which is an important consideration when training models, and computationally designs peptide structures with certain properties (binding affinity for MHC-I). This is likely a valuable paper for generating ideas and potentially useable insights.",
        "relevance_score": 10,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    },
    {
        "title": "AmpLyze: A Deep Learning Model for Predicting the Hemolytic Concentration",
        "summary": "Red-blood-cell lysis (HC50) is the principal safety barrier for\nantimicrobial-peptide (AMP) therapeutics, yet existing models only say \"toxic\"\nor \"non-toxic.\" AmpLyze closes this gap by predicting the actual HC50 value\nfrom sequence alone and explaining the residues that drive toxicity. The model\ncouples residue-level ProtT5/ESM2 embeddings with sequence-level descriptors in\ndual local and global branches, aligned by a cross-attention module and trained\nwith log-cosh loss for robustness to assay noise. The optimal AmpLyze model\nreaches a PCC of 0.756 and an MSE of 0.987, outperforming classical regressors\nand the state-of-the-art. Ablations confirm that both branches are essential,\nand cross-attention adds a further 1% PCC and 3% MSE improvement.\nExpected-Gradients attributions reveal known toxicity hotspots and suggest\nsafer substitutions. By turning hemolysis assessment into a quantitative,\nsequence-based, and interpretable prediction, AmpLyze facilitates AMP design\nand offers a practical tool for early-stage toxicity screening.",
        "url": "http://arxiv.org/abs/2507.08162v2",
        "published_date": "2025-07-10T20:47:06+00:00",
        "updated_date": "2025-08-13T23:59:49+00:00",
        "categories": [
            "q-bio.BM",
            "cs.AI"
        ],
        "authors": [
            "Peng Qiu",
            "Hanqi Feng",
            "Meng-Chun Zhang",
            "Barnabas Poczos"
        ],
        "pdf_url": "http://arxiv.org/pdf/2507.08162v2",
        "tldr": "AmpLyze, a deep learning model, quantitatively predicts the hemolytic concentration (HC50) of antimicrobial peptides from their sequence, outperforming existing methods and providing residue-level interpretability to facilitate safer AMP design.",
        "explanation": "This paper presents a new deep learning model, AmpLyze, designed to predict the hemolytic concentration (HC50) of antimicrobial peptides (AMPs). HC50 is a critical safety metric, and current models often only provide a binary 'toxic' or 'non-toxic' classification. AmpLyze bridges this gap by predicting the actual HC50 value from the peptide sequence itself. The model uses a dual-branch architecture incorporating residue-level embeddings from ProtT5/ESM2 and sequence-level descriptors, aligned using cross-attention and trained with a log-cosh loss function. The model outperforms classical regressors and existing state-of-the-art methods. Ablation studies confirm the importance of all components. Expected-Gradients are used for model interpretation, revealing known toxicity hotspots and suggesting safer substitutions. Key benefits claimed are quantitative prediction, sequence-based approach, and interpretability which helps in AMP design and early-stage toxicity screening.",
        "interests_alignment": "This paper is highly aligned with my research interests. It focuses on machine learning for biomolecules (peptides), specifically for predicting peptide properties relevant to their function and toxicity. The use of deep learning models and the emphasis on interpretability are also key aspects that resonate with my interests. The connection to AMP design could relate to peptide self-assembly if the AMP mechanism involves self-assembly or membrane disruption via assembly.",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    }
]