[
    {
        "title": "Spin-to-charge conversion modulated by chiral molecules",
        "summary": "Molecular chirality and electron spin are intricately intertwined via the\nfascinating phenomenon of chiral-induced spin selectivity (CISS), which has\ngarnered considerable attention due to its extensive potential applications. A\nrecent experiment has revealed that chiral molecules self-assembled on the gold\nsurface can modulate the inverse spin Hall effect, providing an alternative\nplatform for studying the interplay between chirality and spin transport. Our\nstudy uncovers that this modulation stems from the CISS effect, which enhances\nspin currents of one spin orientation while suppressing those of the opposite\nspin orientation. We provide numerical results that are highly consistent with\nthe experimental phenomena and further investigate the influence of various\nfactors on this modulation. This work offers a theoretical explanation of\npreviously unexplained experimental findings, and the underlying physical\nmechanism broadens current perspectives on understanding and applying CISS.",
        "url": "http://arxiv.org/abs/2509.04021v1",
        "published_date": "2025-09-04T08:48:24+00:00",
        "updated_date": "2025-09-04T08:48:24+00:00",
        "categories": [
            "physics.chem-ph"
        ],
        "authors": [
            "Peng-Yi Liu",
            "Tian-Yi Zhang",
            "Ai-Min Guo",
            "Yossi Paltiel",
            "Qing-Feng Sun"
        ],
        "pdf_url": "http://arxiv.org/pdf/2509.04021v1",
        "tldr": "This theoretical study explains how chiral molecules self-assembled on a gold surface modulate spin-to-charge conversion by enhancing spin currents of one orientation and suppressing the opposite, consistent with experimental observations and broadening understanding of CISS.",
        "explanation": "The paper delves into the chiral-induced spin selectivity (CISS) effect and its modulation of the inverse spin Hall effect (ISHE) using numerical simulations. It theoretically explains experimental findings regarding chiral molecules self-assembled on gold surfaces. The study demonstrates that chiral molecules enhance specific spin currents while suppressing others, leading to asymmetric spin-to-charge conversion. The results are consistent with experimental data and offer insights into controlling spin transport at room temperature. The paper uses tight-binding models and non-equilibrium Green's function methods.",
        "interests_alignment": "While not directly focused on peptides, it involves self-assembly of chiral molecules on surfaces, a phenomenon that shares conceptual similarities with peptide self-assembly. Also, the study models a biomolecular phenomenon and thus is of strong potential relevance to my research interests. The paper focuses on theoretical methods and experimental validation of the CISS effect related to molecular chirality, which is of potential relevance to how chirality affects peptide interactions and aggregation.",
        "relevance_score": 7,
        "novelty_claim_score": 7,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]