[
    {
        "title": "Following the Committor Flow: A Data-Driven Discovery of Transition Pathways",
        "summary": "The discovery of transition pathways to unravel distinct reaction mechanisms\nand, in general, rare events that occur in molecular systems is still a\nchallenge. Recent advances have focused on analyzing the transition path\nensemble using the committor probability, widely regarded as the most\ninformative one-dimensional reaction coordinate. Consistency between transition\npathways and the committor function is essential for accurate mechanistic\ninsight. In this work, we propose an iterative framework to infer the committor\nand, subsequently, to identify the most relevant transition pathways. Starting\nfrom an initial guess for the transition path, we generate biased sampling from\nwhich we train a neural network to approximate the committor probability. From\nthis learned committor, we extract dominant transition channels as discretized\nstrings lying on isocommittor surfaces. These pathways are then used to enhance\nsampling and iteratively refine both the committor and the transition paths\nuntil convergence. The resulting committor enables accurate estimation of the\nreaction rate constant. We demonstrate the effectiveness of our approach on\nbenchmark systems, including a two-dimensional model potential, peptide\nconformational transitions, and a Diels--Alder reaction.",
        "url": "http://arxiv.org/abs/2507.21961v1",
        "published_date": "2025-07-29T16:10:52+00:00",
        "updated_date": "2025-07-29T16:10:52+00:00",
        "categories": [
            "physics.comp-ph",
            "cond-mat.stat-mech",
            "physics.chem-ph"
        ],
        "authors": [
            "Cheng Giuseppe Chen",
            "Chenyu Tang",
            "Alberto Megías",
            "Radu A. Talmazan",
            "Sergio Contreras Arredondo",
            "Benoît Roux",
            "Christophe Chipot"
        ],
        "pdf_url": "http://arxiv.org/pdf/2507.21961v1",
        "tldr": "This paper introduces an iterative, data-driven framework using neural networks to discover transition pathways in molecular systems, particularly for rare events like peptide conformational changes and chemical reactions, by learning and refining the committor probability.",
        "explanation": "The paper addresses the challenge of identifying transition pathways in molecular systems, especially for rare events. The core idea is an iterative framework that combines biased sampling with neural network-based learning of the committor probability. The approach starts with an initial guess of the transition path, generates biased sampling, and trains a neural network to approximate the committor. The learned committor helps extract dominant transition channels, which are then used to refine sampling and iteratively improve both the committor and the transition paths. The method's effectiveness is demonstrated on benchmark systems, including peptide conformational transitions, suggesting its potential for understanding complex molecular processes.",
        "interests_alignment": "The paper aligns with my interest in machine learning for biomolecules, particularly peptides. The application of neural networks to understand peptide conformational transitions directly relates to my research interests. Although it doesn't directly address peptide self-assembly, the method might be adaptable to studying assembly pathways.",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "Multiscale geometrical and topological learning in the analysis of soft matter collective dynamics",
        "summary": "Understanding the behavior and evolution of a dynamical many-body system by\nanalyzing patterns in their experimentally captured images is a promising\nmethod relevant for a variety of living and non-living self-assembled systems.\nThe arrays of moving liquid crystal skyrmions studied here are a representative\nexample of hierarchically organized materials that exhibit complex\nspatiotemporal dynamics driven by multiscale processes. Joint geometric and\ntopological data analysis (TDA) offers a powerful framework for investigating\nsuch systems by capturing the underlying structure of the data at multiple\nscales. In the TDA approach, we introduce the $\\Psi$-function, a robust\nnumerical topological descriptor related to both the spatiotemporal changes in\nthe size and shape of individual topological solitons and the emergence of\nregions with their different spatial organization. The geometric method based\non the analysis of vector fields generated from images of skyrmion ensembles\noffers insights into the nonlinear physical mechanisms of the system's response\nto external stimuli and provides a basis for comparison with theoretical\npredictions. The methodology presented here is very general and can provide a\ncharacterization of system behavior both at the level of individual\npattern-forming agents and as a whole, allowing one to relate the results of\nimage data analysis to processes occurring in a physical, chemical, or\nbiological system in the real world.",
        "url": "http://arxiv.org/abs/2507.21265v1",
        "published_date": "2025-07-28T18:40:37+00:00",
        "updated_date": "2025-07-28T18:40:37+00:00",
        "categories": [
            "cond-mat.soft",
            "cond-mat.mtrl-sci",
            "cs.LG",
            "math.AT"
        ],
        "authors": [
            "Tetiana Orlova",
            "Amaranta Membrillo Solis",
            "Hayley R. O. Sohn",
            "Tristan Madeleine",
            "Giampaolo D'Alessandro",
            "Ivan I. Smalyukh",
            "Malgosia Kaczmarek",
            "Jacek Brodzki"
        ],
        "pdf_url": "http://arxiv.org/pdf/2507.21265v1",
        "tldr": "This paper presents a multiscale geometrical and topological data analysis (TDA) approach for analyzing the collective dynamics of soft matter systems, specifically arrays of moving liquid crystal skyrmions, using a novel descriptor called the Ψ-function and vector field analysis. The methodology is proposed as generalizable to physical, chemical, and biological systems based on image analysis.",
        "explanation": "The paper introduces a method combining geometrical and topological data analysis (TDA) to study the dynamics of complex, self-assembled systems. It uses arrays of moving liquid crystal skyrmions as a representative example. The key innovations appear to be the \\Psi-function, a topological descriptor purportedly superior to existing methods for tracking spatiotemporal changes, and the use of vector field analysis to extract insights into nonlinear physical mechanisms. The approach aims to characterize system behavior from individual agents to the entire collective, claiming broad applicability beyond the specific skyrmion example.",
        "interests_alignment": "The paper is tangentially relevant. While not directly about peptide self-assembly, the methods (TDA, geometrical analysis, ML for image analysis) and the focus on self-assembled systems are potentially relevant. I'm interested in machine learning for biomolecules and peptide self-assembly, so a machine learning approach to other self-assembling system can be relevant.",
        "relevance_score": 4,
        "novelty_claim_score": 7,
        "clarity_score": 7,
        "potential_impact_score": 6,
        "overall_priority_score": 5
    }
]