[
    {
        "title": "Multiscale Growth Kinetics of Model Biomolecular Condensates Under Passive and Active Conditions",
        "summary": "Living cells exhibit a complex organization comprising numerous compartments,\namong which are RNA- and protein-rich membraneless, liquid-like organelles\nknown as biomolecular condensates. Energy-consuming processes regulate their\nformation and dissolution, with (de-)phosphorylation by specific enzymes being\namong the most commonly involved reactions. By employing a model system\nconsisting of a phosphorylatable peptide and homopolymeric RNA, we elucidate\nhow enzymatic activity modulates the growth kinetics and alters the local\nstructure of biomolecular condensates. Under passive condition, time-resolved\nultra-small-angle X-ray scattering with synchrotron source reveals a\nnucleation-driven coalescence mechanism maintained over four decades in time,\nsimilar to the coarsening of simple binary fluid mixtures. Coarse-grained\nmolecular dynamics simulations show that peptide-decorated RNA chains assembled\nshortly after mixing constitute the relevant subunits. In contrast,\nactively-formed condensates initially display a local mass fractal structure,\nwhich gradually matures upon enzymatic activity before condensates undergo\ncoalescence. Both types of condensate eventually reach a steady state but\nfluorescence recovery after photobleaching indicates a peptide diffusivity\ntwice higher in actively-formed condensates consistently with their\nloosely-packed local structure. We expect multiscale, integrative approaches\nimplemented with model systems to link effectively the functional properties of\nmembraneless organelles to their formation and dissolution kinetics as\nregulated by cellular active processes.",
        "url": "http://arxiv.org/abs/2508.16398v1",
        "published_date": "2025-08-22T14:00:08+00:00",
        "updated_date": "2025-08-22T14:00:08+00:00",
        "categories": [
            "physics.bio-ph",
            "cond-mat.soft",
            "q-bio.BM",
            "q-bio.SC"
        ],
        "authors": [
            "Tamizhmalar Sundararajan",
            "Matteo Boccalini",
            "Roméo Suss",
            "Sandrine Mariot",
            "Emerson R. Da Silva",
            "Fernando C. Giacomelli",
            "Austin Hubley",
            "Theyencheri Narayanan",
            "Alessandro Barducci",
            "Guillaume Tresset"
        ],
        "pdf_url": "http://arxiv.org/pdf/2508.16398v1",
        "tldr": "This paper investigates the growth kinetics of biomolecular condensates composed of a phosphorylatable peptide and RNA under passive and active (enzymatically controlled) conditions. It reveals different growth mechanisms and local structures depending on the presence of enzymatic activity, using time-resolved ultra-small-angle X-ray scattering, coarse-grained molecular dynamics simulations, and confocal microscopy.",
        "explanation": "The research uses a model system to mimic the formation of membraneless organelles, which are important for cellular organization. By comparing passive and active (enzyme-regulated) condensate formation, the study reveals that passive condensates grow via Brownian motion-induced coalescence, leading to compact spherical structures. Active condensates, on the other hand, initially form loosely packed, network-like structures that later mature and undergo coalescence. Fluorescence recovery after photobleaching (FRAP) confirms differences in peptide diffusivity between the two types of condensates. The study uses a combination of experimental techniques (TR-USAXS, confocal microscopy, FRAP) and coarse-grained MD simulations to cover a wide range of length and timescales.",
        "interests_alignment": "The paper aligns with my research interests in several ways. First, it involves peptide self-assembly, although as part of a peptide/RNA co-assembly. Second, it uses computational simulation (coarse-grained MD) which is great. Third, it investigates the structure of assembled peptides (indirectly). I would have liked it more if the peptide can self assemble by itself.",
        "relevance_score": 7,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 7
    }
]