[
    {
        "title": "GridFF: Efficient Simulation of Organic Molecules on Rigid Substrates",
        "summary": "We present GridFF, an efficient method for simulating molecules on rigid\nsubstrates, derived from techniques used in protein-ligand docking in\nbiochemistry. By projecting molecule-substrate interactions onto precomputed\nspatial grids with tricubic B-spline interpolation, GridFF reduces the\ncomputational cost by orders of magnitude compared to traditional pairwise\natomistic models, without compromising the accuracy of forces or trajectories.\nThe CPU implementation of GridFF in the open-source FireCore package provides a\n100-1000x speedup over all-atom simulations using LAMMPS, while the GPU\nimplementation - running thousands of system replicas in parallel - samples\nmillions of configurations per second, enabling an exhaustive exploration of\nthe configuration space of small flexible molecules on surfaces within minutes.\nFurthermore, as demonstrated in our previous application of a similar technique\nto high-resolution scanning probe microscopy, GridFF can be extended beyond\nempirical pairwise potentials to those derived from ab initio electron\ndensities. Altogether, this unlocks accurate high-throughput modeling of\nmolecular self-assembly, adsorption, and scanning probe manipulation in surface\nscience.",
        "url": "http://arxiv.org/abs/2508.15522v1",
        "published_date": "2025-08-21T12:50:55+00:00",
        "updated_date": "2025-08-21T12:50:55+00:00",
        "categories": [
            "physics.chem-ph"
        ],
        "authors": [
            "Indranil Mal",
            "Milan Kočí",
            "Paolo Nicolini",
            "Prokop Hapala"
        ],
        "pdf_url": "http://arxiv.org/pdf/2508.15522v1",
        "tldr": "GridFF is presented as a computationally efficient method for simulating organic molecules on rigid substrates, achieving significant speedups compared to traditional atomistic simulations while maintaining accuracy. The method is applied to problems in surface science, including molecular self-assembly and SPM manipulation.",
        "explanation": "This paper introduces GridFF, a method that uses precomputed spatial grids and B-spline interpolation to model molecule-substrate interactions. This approach significantly reduces computational cost compared to traditional atomistic simulations. The paper claims a 100-1000x speedup on CPU and even faster sampling on GPU. It is claimed that this unlocks accurate, high-throughput modeling of molecular self-assembly, adsorption, and SPM manipulation. The method's accuracy is demonstrated with PTCDA on NaCl, showing good agreement with LAMMPS simulations, including scenarios with surface defects.",
        "interests_alignment": "The paper is tangentially relevant to my interests, particularly in the 'computational screening or simulation of structure or assembly/aggregation of peptides' area. While the paper focuses on generic organic molecules on surfaces, the GridFF method could potentially be adapted for simulating peptide self-assembly on surfaces or interfaces, especially if the substrate can be considered rigid. The application to molecular self-assembly is directly relevant.",
        "relevance_score": 6,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 6
    }
]