[
    {
        "title": "OTMol: Robust Molecular Structure Comparison via Optimal Transport",
        "summary": "Root-mean-square deviation (RMSD) is widely used to assess structural\nsimilarity in systems ranging from flexible ligand conformers to complex\nmolecular cluster configurations. Despite its wide utility, RMSD calculation is\noften challenged by inconsistent atom ordering, indistinguishable\nconfigurations in molecular clusters, and potential chirality inversion during\nalignment. These issues highlight the necessity of accurate atom-to-atom\ncorrespondence as a prerequisite for meaningful alignment. Traditional\napproaches often rely on heuristic cost matrices combined with the Hungarian\nalgorithm, yet these methods underutilize the rich intra-molecular structural\ninformation and may fail to generalize across chemically diverse systems. In\nthis work, we introduce OTMol, a method that formulates the molecular alignment\ntask as a fused supervised Gromov-Wasserstein (fsGW) optimal transport problem.\nBy leveraging the intrinsic geometric and topological relationships within each\nmolecule, OTMol eliminates the need for manually defined cost functions and\nenables a principled, data-driven matching strategy. Importantly, OTMol\npreserves key chemical features such as molecular chirality and bond\nconnectivity consistency. We evaluate OTMol across a wide range of molecular\nsystems, including Adenosine triphosphate, Imatinib, lipids, small peptides,\nand water clusters, and demonstrate that it consistently achieves low RMSD\nvalues while preserving computational efficiency. Importantly, OTMol maintains\nmolecular integrity by enforcing one-to-one mappings between entire molecules,\nthereby avoiding erroneous many-to-one alignments that often arise in comparing\nmolecular clusters. Our results underscore the utility of optimal transport\ntheory for molecular alignment and offer a generalizable framework applicable\nto structural comparison tasks in cheminformatics, molecular modeling, and\nrelated disciplines.",
        "url": "http://arxiv.org/abs/2509.01550v1",
        "published_date": "2025-09-01T15:27:31+00:00",
        "updated_date": "2025-09-01T15:27:31+00:00",
        "categories": [
            "q-bio.BM",
            "math.OC",
            "92E10, 49Q22"
        ],
        "authors": [
            "Xiaoqi Wei",
            "Xuhang Dai",
            "Yaqi Wu",
            "Yanxiang Zhao",
            "Yingkai Zhang",
            "Zixuan Cang"
        ],
        "pdf_url": "http://arxiv.org/pdf/2509.01550v1",
        "tldr": "This paper introduces OTMol, a novel method using fused supervised Gromov-Wasserstein optimal transport for robust molecular structure comparison, addressing limitations of RMSD calculations related to atom ordering, indistinguishable configurations, and chirality inversion.",
        "explanation": "The paper addresses the problem of accurately comparing molecular structures, a crucial task in cheminformatics and molecular modeling. It introduces OTMol, a method that uses fused supervised Gromov-Wasserstein optimal transport to overcome limitations of RMSD calculations, such as inconsistencies in atom ordering, issues with molecular clusters, and chirality inversion. The method leverages geometric and topological relationships within molecules, eliminating the need for manually defined cost functions and preserving key chemical features. The evaluation shows OTMol achieves low RMSD while maintaining computational efficiency and molecular integrity across diverse molecular systems.",
        "interests_alignment": "The paper aligns with my interest in machine learning for biomolecules, particularly in addressing structural comparison. While not focused on peptide self-assembly directly, the methodology for robust structure comparison could be applicable to analyzing peptide aggregates or assemblies. The work demonstrates a computational tool that could be valuable for screening or simulating structures.",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]