[
    {
        "title": "Zero-Shot Cyclic Peptide Design via Composable Geometric Constraints",
        "summary": "Cyclic peptides, characterized by geometric constraints absent in linear\npeptides, offer enhanced biochemical properties, presenting new opportunities\nto address unmet medical needs. However, designing target-specific cyclic\npeptides remains underexplored due to limited training data. To bridge the gap,\nwe propose CP-Composer, a novel generative framework that enables zero-shot\ncyclic peptide generation via composable geometric constraints. Our approach\ndecomposes complex cyclization patterns into unit constraints, which are\nincorporated into a diffusion model through geometric conditioning on nodes and\nedges. During training, the model learns from unit constraints and their random\ncombinations in linear peptides, while at inference, novel constraint\ncombinations required for cyclization are imposed as input. Experiments show\nthat our model, despite trained with linear peptides, is capable of generating\ndiverse target-binding cyclic peptides, reaching success rates from 38% to 84%\non different cyclization strategies.",
        "url": "http://arxiv.org/abs/2507.04225v2",
        "published_date": "2025-07-06T03:30:45+00:00",
        "updated_date": "2025-07-14T14:33:47+00:00",
        "categories": [
            "cs.LG",
            "cs.AI"
        ],
        "authors": [
            "Dapeng Jiang",
            "Xiangzhe Kong",
            "Jiaqi Han",
            "Mingyu Li",
            "Rui Jiao",
            "Wenbing Huang",
            "Stefano Ermon",
            "Jianzhu Ma",
            "Yang Liu"
        ],
        "pdf_url": "http://arxiv.org/pdf/2507.04225v2",
        "tldr": "The paper introduces CP-Composer, a novel generative framework for zero-shot cyclic peptide design based on composable geometric constraints, achieving promising success rates in generating target-binding cyclic peptides.",
        "explanation": "This paper tackles the challenge of designing cyclic peptides, which have enhanced biochemical properties but are difficult to generate due to limited training data. The proposed CP-Composer framework uses a diffusion model conditioned on geometric constraints derived from different cyclization strategies. The model is trained on linear peptides, and at inference, it can generate cyclic peptides with novel combinations of constraints, achieving success rates from 38% to 84% on various cyclization strategies. Experiments demonstrate its ability to generate diverse target-binding cyclic peptides.",
        "interests_alignment": "The paper is highly aligned with my research interests. It directly involves machine learning for peptides to design and generate novel cyclical structures with enhanced properties. The problem of peptide design and specifically cyclic peptide is definitely of high interest. The approach of zero-shot learning and generative framework resonates with my interest in computational screening or simulation.",
        "relevance_score": 10,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    }
]