[
    {
        "title": "Morphology-Specific Peptide Discovery via Masked Conditional Generative Modeling",
        "summary": "Peptide self-assembly prediction offers a powerful bottom-up strategy for\ndesigning biocompatible, low-toxicity materials for large-scale synthesis in a\nbroad range of biomedical and energy applications. However, screening the vast\nsequence space for categorization of aggregate morphology remains intractable.\nWe introduce PepMorph, an end-to-end peptide discovery pipeline that generates\nnovel sequences that are not only prone to aggregate but self-assemble into a\nspecified fibrillar or spherical morphology. We compiled a new dataset by\nleveraging existing aggregation propensity datasets and extracting geometric\nand physicochemical isolated peptide descriptors that act as proxies for\naggregate morphology. This dataset is then used to train a Transformer-based\nConditional Variational Autoencoder with a masking mechanism, which generates\nnovel peptides under arbitrary conditioning. After filtering to ensure design\nspecifications and validation of generated sequences through coarse-grained\nmolecular dynamics simulations, PepMorph yielded 83% accuracy in intended\nmorphology generation, showcasing its promise as a framework for\napplication-driven peptide discovery.",
        "url": "http://arxiv.org/abs/2509.02060v2",
        "published_date": "2025-09-02T07:58:12+00:00",
        "updated_date": "2025-09-04T08:13:53+00:00",
        "categories": [
            "q-bio.BM",
            "cs.LG"
        ],
        "authors": [
            "Nuno Costa",
            "Julija Zavadlav"
        ],
        "pdf_url": "http://arxiv.org/pdf/2509.02060v2",
        "tldr": "This paper introduces PepMorph, a Transformer-based conditional variational autoencoder pipeline for generating novel peptide sequences that self-assemble into specified fibrillar or spherical morphologies, achieving 83% accuracy in intended morphology generation validated by molecular dynamics simulations.",
        "explanation": "The paper addresses the challenge of efficiently exploring the vast sequence space for peptide self-assembly with specific morphologies (fibrillar or spherical). It introduces PepMorph, a novel end-to-end pipeline that leverages a Transformer-based Conditional Variational Autoencoder with a masking mechanism. The model is trained on a new dataset combining aggregation propensity data and geometric/physicochemical descriptors as morphology proxies. Post-generation filtering and coarse-grained molecular dynamics simulations are used to validate the generated sequences, demonstrating 83% accuracy in achieving the target morphology. The masking mechanism allows flexible conditioning on various properties, and the pipeline shows promise for application-driven peptide discovery.",
        "interests_alignment": "This paper aligns strongly with my research interests. It focuses on peptide self-assembly and aggregation, uses machine learning (specifically, a Transformer-based VAE) for peptide design, and involves creating and utilizing a dataset relevant to peptide structure and aggregation. Furthermore, it employs computational simulation (molecular dynamics) to validate the generated peptides' assembly and morphology. The specific focus on morphology control is particularly relevant.",
        "relevance_score": 10,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    }
]