[
    {
        "title": "Spin-to-charge conversion modulated by chiral molecules",
        "summary": "Molecular chirality and electron spin are intricately intertwined via the\nfascinating phenomenon of chiral-induced spin selectivity (CISS), which has\ngarnered considerable attention due to its extensive potential applications. A\nrecent experiment has revealed that chiral molecules self-assembled on the gold\nsurface can modulate the inverse spin Hall effect, providing an alternative\nplatform for studying the interplay between chirality and spin transport. Our\nstudy uncovers that this modulation stems from the CISS effect, which enhances\nspin currents of one spin orientation while suppressing those of the opposite\nspin orientation. We provide numerical results that are highly consistent with\nthe experimental phenomena and further investigate the influence of various\nfactors on this modulation. This work offers a theoretical explanation of\npreviously unexplained experimental findings, and the underlying physical\nmechanism broadens current perspectives on understanding and applying CISS.",
        "url": "http://arxiv.org/abs/2509.04021v1",
        "published_date": "2025-09-04T08:48:24+00:00",
        "updated_date": "2025-09-04T08:48:24+00:00",
        "categories": [
            "physics.chem-ph"
        ],
        "authors": [
            "Peng-Yi Liu",
            "Tian-Yi Zhang",
            "Ai-Min Guo",
            "Yossi Paltiel",
            "Qing-Feng Sun"
        ],
        "pdf_url": "http://arxiv.org/pdf/2509.04021v1",
        "tldr": "This paper theoretically explains the modulation of spin-to-charge conversion by chiral molecules self-assembled on a gold surface, attributing it to the CISS effect. Numerical results are consistent with experimental observations.",
        "explanation": "The paper investigates the chiral-induced spin selectivity (CISS) effect in chiral molecules self-assembled on a gold surface and its influence on inverse spin Hall effect (ISHE). It provides a theoretical explanation for experimental findings where chiral molecules modulate spin-to-charge conversion. The authors use a tight-binding model incorporating FMR, SHE, and chiral molecule components. They demonstrated that the CISS effect modulates the spin currents, ultimately affecting ISHE. Numerical results are validated against experimental data, plus several control experiments provide extra validation. Length dependence and dephasing strength are also explored.",
        "interests_alignment": "While the paper focuses on spintronics and the CISS effect rather than peptide self-assembly directly, the modeling of chiral molecules and their interactions with surfaces could be relevant to understanding the influence of chirality on peptide assembly processes on surfaces or interfaces. Also, the high-throughput method to produce self-assembled configurations is extremely interesting.",
        "relevance_score": 4,
        "novelty_claim_score": 6,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 5
    }
]