[
    {
        "title": "Droplet growth, Ostwald's rule, and emergence of order in Fused in Sarcoma",
        "summary": "The low complexity domain of Fused in Sarcoma (FUS-LC consisting of 214\nresidues) undergoes phase separation, resulting in a dense liquid-like phase\nthat forms early and slowly matures to reach ordered gel-like state on long\ntime scales. Upon maturation, core-1, comprising of the 57 residues (39-95) in\nthe N-terminus become structured, resulting in the formation of a\nnon-polymorphic fibril. The truncated FUS-LC-C (residues 110-214) construct\nforms a fibril in which core-2 (residues 112-150) adopts a $\\beta$-sheet\nstructure. Using coarse-grained monomer SOP-IDP model simulations of FUS-LC, we\npredict that residues 155-190 in the C-terminal (core-3) form rapidly, followed\nby core-2, and finally core-1. The time scale of formation of the cores and\ntheir stabilities are inversely correlated, as anticipated by the Ostwald's\nrule of stages. Unbiased multichain simulations show that the chemical\npotentials in the two phases are equal and the calculated densities of the\ndense and dilute phases are in agreement with experiments. The dense phase,\nwhich forms by a nucleation mechanism, coarsens over time by a process that is\nreminiscent of Ostwald ripening. AlphaFold predictions of the core-3 structure\nand the simulations show that $\\beta$-strand emerges in the core-3 region early\nduring the droplet formation, and drives the initiation of FUS-LC assembly. The\ntechniques introduced here are general and could be used to probe assembly of\nother IDPs such as TDP-43, which shares many features with FUS-LC.",
        "url": "http://arxiv.org/abs/2506.21792v1",
        "published_date": "2025-06-26T22:23:04+00:00",
        "updated_date": "2025-06-26T22:23:04+00:00",
        "categories": [
            "cond-mat.soft",
            "q-bio.BM"
        ],
        "authors": [
            "Farkhad Maksudov",
            "Mauro L. Mugnai",
            "Laura Dominguez",
            "Dmitrii Makarov",
            "D. Thirumalai"
        ],
        "pdf_url": "http://arxiv.org/pdf/2506.21792v1",
        "tldr": "This paper combines coarse-grained simulations, AlphaFold predictions, and experimental data to investigate the phase separation and self-assembly of the FUS-LC protein, revealing the critical role of core-3 and supporting Ostwald's rule of stages in the assembly process.",
        "explanation": "The paper delves into the mechanism of droplet growth during phase separation in Fused in Sarcoma (FUS) using coarse-grained simulations and AlphaFold predictions. Key findings include the early formation of core-3 driving FUS-LC assembly, agreement with Ostwald's rule of stages, and validation of simulation results against experimental data. The study examines nucleation, Ostwald ripening, and the role of interchain interactions. It pinpoints the specific residues (164-176) within core-3 as crucial for initiating phase separation and validates predicted structural models against experimental observations, suggesting techniques can be applied to other IDPs such as TDP-43.",
        "interests_alignment": "The paper is highly relevant to my research interests, as it focuses on peptide self-assembly/aggregation, uses machine learning (AlphaFold) for structure prediction, and employs computational simulations methods to study the assembly process of a low complexity domain, which is analogous to peptide assembly in many ways. Applying a coarse-grained model to a specific protein addresses a fundamental question common across different biomolecular self-assembly, and specifically mentions applicability to other IDPs.",
        "relevance_score": 9,
        "novelty_claim_score": 7,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]