[
    {
        "title": "pUniFind: a unified large pre-trained deep learning model pushing the limit of mass spectra interpretation",
        "summary": "Deep learning has advanced mass spectrometry data interpretation, yet most\nmodels remain feature extractors rather than unified scoring frameworks. We\npresent pUniFind, the first large-scale multimodal pre-trained model in\nproteomics that integrates end-to-end peptide-spectrum scoring with open,\nzero-shot de novo sequencing. Trained on over 100 million open search-derived\nspectra, pUniFind aligns spectral and peptide modalities via cross modality\nprediction and outperforms traditional engines across diverse datasets,\nparticularly achieving a 42.6 percent increase in the number of identified\npeptides in immunopeptidomics. Supporting over 1,300 modifications, pUniFind\nidentifies 60 percent more PSMs than existing de novo methods despite a\n300-fold larger search space. A deep learning based quality control module\nfurther recovers 38.5 percent additional peptides including 1,891 mapped to the\ngenome but absent from reference proteomes while preserving full fragment ion\ncoverage. These results establish a unified, scalable deep learning framework\nfor proteomic analysis, offering improved sensitivity, modification coverage,\nand interpretability.",
        "url": "http://arxiv.org/abs/2507.00087v1",
        "published_date": "2025-06-30T08:32:39+00:00",
        "updated_date": "2025-06-30T08:32:39+00:00",
        "categories": [
            "cs.LG",
            "cs.AI"
        ],
        "authors": [
            "Jiale Zhao",
            "Pengzhi Mao",
            "Kaifei Wang",
            "Yiming Li",
            "Yaping Peng",
            "Ranfei Chen",
            "Shuqi Lu",
            "Xiaohong Ji",
            "Jiaxiang Ding",
            "Xin Zhang",
            "Yucheng Liao",
            "Weinan E",
            "Weijie Zhang",
            "Han Wen",
            "Hao Chi"
        ],
        "pdf_url": "http://arxiv.org/pdf/2507.00087v1",
        "tldr": "pUniFind is a novel large-scale multimodal deep learning model for proteomics mass spectra interpretation, integrating peptide-spectrum scoring and open, zero-shot de novo sequencing, achieving significant improvements in peptide identification and modification coverage.",
        "explanation": "This paper introduces pUniFind, a large pre-trained deep learning model for interpreting mass spectrometry data in proteomics. It unifies peptide-spectrum matching (PSM) scoring with de novo sequencing, addressing the limitations of existing methods that primarily function as feature extractors. pUniFind is trained on a massive dataset of 100 million spectra and outperforms traditional search engines, particularly in immunopeptidomics, by significantly increasing peptide identification rates and modification coverage. A quality control module further enhances the results by recovering additional peptides. The results indicate a crucial advance towards a unified and scalable deep learning framework for proteomic analysis.",
        "interests_alignment": "While this paper does not directly address peptide self-assembly, it introduces a powerful new deep learning method for analyzing peptide sequences and modifications from mass spectrometry data. This could be valuable for characterizing peptides identified in self-assembly experiments or for predicting modifications that influence assembly. The model itself is less relevant, but the general machine learning for peptides angle is interesting.",
        "relevance_score": 4,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 6
    }
]