[
    {
        "title": "epiGPTope: A machine learning-based epitope generator and classifier",
        "summary": "Epitopes are short antigenic peptide sequences which are recognized by\nantibodies or immune cell receptors. These are central to the development of\nimmunotherapies, vaccines, and diagnostics. However, the rational design of\nsynthetic epitope libraries is challenging due to the large combinatorial\nsequence space, $20^n$ combinations for linear epitopes of n amino acids,\nmaking screening and testing unfeasible, even with high throughput experimental\ntechniques. In this study, we present a large language model, epiGPTope,\npre-trained on protein data and specifically fine-tuned on linear epitopes,\nwhich for the first time can directly generate novel epitope-like sequences,\nwhich are found to possess statistical properties analogous to the ones of\nknown epitopes. This generative approach can be used to prepare libraries of\nepitope candidate sequences. We further train statistical classifiers to\npredict whether an epitope sequence is of bacterial or viral origin, thus\nnarrowing the candidate library and increasing the likelihood of identifying\nspecific epitopes. We propose that such combination of generative and\npredictive models can be of assistance in epitope discovery. The approach uses\nonly primary amino acid sequences of linear epitopes, bypassing the need for a\ngeometric framework or hand-crafted features of the sequences. By developing a\nmethod to create biologically feasible sequences, we anticipate faster and more\ncost-effective generation and screening of synthetic epitopes, with relevant\napplications in the development of new biotechnologies.",
        "url": "http://arxiv.org/abs/2509.03351v1",
        "published_date": "2025-09-03T14:36:06+00:00",
        "updated_date": "2025-09-03T14:36:06+00:00",
        "categories": [
            "cs.LG",
            "cs.AI",
            "q-bio.QM"
        ],
        "authors": [
            "Natalia Flechas Manrique",
            "Alberto Martínez",
            "Elena López-Martínez",
            "Luc Andrea",
            "Román Orus",
            "Aitor Manteca",
            "Aitziber L. Cortajarena",
            "Llorenç Espinosa-Portalés"
        ],
        "pdf_url": "http://arxiv.org/pdf/2509.03351v1",
        "tldr": "This paper introduces epiGPTope, a language model fine-tuned on epitope sequences for generating novel epitope candidates and classifying their origin (bacterial/viral), potentially accelerating epitope discovery for biotechnological applications.",
        "explanation": "The paper presents a machine learning approach, epiGPTope, leveraging a pre-trained protein language model fine-tuned specifically for epitope generation and classification. The core idea is to generate novel epitope-like sequences, which statistically resemble known epitopes, addressing the challenge of the large sequence space in epitope design. Furthermore, the model predicts the origin (bacterial or viral) of epitope sequences, assisting in focusing experimental efforts. The method is sequence-based, foregoing the need for structural information or hand-engineered features.",
        "interests_alignment": "This paper strongly aligns with my research interests in machine learning for peptides and biomolecules. The application of large language models to generate and classify peptide sequences, specifically epitopes, is directly relevant. While the focus isn't on peptide self-assembly, the general methodology could potentially be adapted to design peptides with specific self-assembling properties or to predict aggregation propensities. The potential for generating novel peptide sequences is a key aspect that aligns with my interests in computational screening.",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    }
]