[
    {
        "title": "Amortized Sampling with Transferable Normalizing Flows",
        "summary": "Efficient equilibrium sampling of molecular conformations remains a core\nchallenge in computational chemistry and statistical inference. Classical\napproaches such as molecular dynamics or Markov chain Monte Carlo inherently\nlack amortization; the computational cost of sampling must be paid in-full for\neach system of interest. The widespread success of generative models has\ninspired interest into overcoming this limitation through learning sampling\nalgorithms. Despite performing on par with conventional methods when trained on\na single system, learned samplers have so far demonstrated limited ability to\ntransfer across systems. We prove that deep learning enables the design of\nscalable and transferable samplers by introducing Prose, a 280 million\nparameter all-atom transferable normalizing flow trained on a corpus of peptide\nmolecular dynamics trajectories up to 8 residues in length. Prose draws\nzero-shot uncorrelated proposal samples for arbitrary peptide systems,\nachieving the previously intractable transferability across sequence length,\nwhilst retaining the efficient likelihood evaluation of normalizing flows.\nThrough extensive empirical evaluation we demonstrate the efficacy of Prose as\na proposal for a variety of sampling algorithms, finding a simple importance\nsampling-based finetuning procedure to achieve superior performance to\nestablished methods such as sequential Monte Carlo on unseen tetrapeptides. We\nopen-source the Prose codebase, model weights, and training dataset, to further\nstimulate research into amortized sampling methods and finetuning objectives.",
        "url": "http://arxiv.org/abs/2508.18175v1",
        "published_date": "2025-08-25T16:28:18+00:00",
        "updated_date": "2025-08-25T16:28:18+00:00",
        "categories": [
            "cs.LG",
            "cs.AI"
        ],
        "authors": [
            "Charlie B. Tan",
            "Majdi Hassan",
            "Leon Klein",
            "Saifuddin Syed",
            "Dominique Beaini",
            "Michael M. Bronstein",
            "Alexander Tong",
            "Kirill Neklyudov"
        ],
        "pdf_url": "http://arxiv.org/pdf/2508.18175v1",
        "tldr": "This paper introduces Prose, a transferable normalizing flow model for efficient equilibrium sampling of molecular conformations in peptides, demonstrating superior performance to established methods on unseen systems.",
        "explanation": "The paper addresses the challenge of efficient molecular conformation sampling, which conventional methods like molecular dynamics (MD) and Markov chain Monte Carlo (MCMC) struggle with due to lack of amortization (i.e. computational cost for each new system). It introduces Prose, a large-scale transferable normalizing flow model trained on a large dataset of peptide trajectories. Prose generates uncorrelated proposal samples for various peptide systems, demonstrating sequence length transferability and efficient likelihood evaluation. The authors found that an importance sampling-based finetuning procedure achieves superior performance to sequential Monte Carlo on unseen tetrapeptides. They also open-sourced the model, codebase, and training data.",
        "interests_alignment": "This paper strongly aligns with my research interests. It directly tackles the problem of efficient sampling of peptide conformations using machine learning, a central theme in one of my areas of interest. The focus on transferability across sequence lengths is highly relevant for peptide self-assembly and co-assembly, where the size and composition of peptides can vary. The use of normalizing flows as generative models for peptide structure is also well aligned with my machine learning interests. Finally, their data-driven approach, using peptide trajectories, including the release of code and dataset, strongly resonates with my emphasis on simulation and peptide structure datasets.",
        "relevance_score": 10,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    }
]